<h1>แบบฝึกหัด</h1>
<h1>Part System</h1>
	<div align="left" style="margin-left:50px;">
		<p>1.ให้ทำการลง apache บน ubuntu (โดยใช้ virutal box) และทำการส่ง full screen capture ตอนเรียกเว็บ http://localhost (ผลลัพธ์ที่ได้จะเขียนว่า It work!)</p>
	</div>
<h1>Part Network</h1>
	<div align="left" style="margin-left:50px;">
		<p>1.การตั้งค่า ip สองเครื่องนี้สามารถ ping หากันได้หรือไม่ เพราะอะไร</p>
		1.1<br/>
		Node 1 : 161.246.99.24/26<br/>
		Node 2 : 161.246.99.220/26<br/>
		1.2<br/>
		Node 1 : 161.246.99.10/255.255.255.0<br/>
		Node 2 : 161.246.99.5/255.255.255.240<br/>
		<p>2.อุปกรณ์ประเภท Hub และ Switch มีการทำงานในเบื้องต้นต่างกันอย่างไร</p>
	</div>
<h1>Part Web Programming</h1>
	<div align="left" style="margin-left:50px;">
		<p>1.จง<strong>เลือก</strong>เขียนโปรแกรมจากที่กำหนดให้อย่างน้อย 1 ข้อ</p>
		1.1. โปรแกรมรับ input จากผู้ใช้เป็นตัวเลข และแสดงตารางสูตรคูณ<br>
		1.2. โปรแกรมรับ input จากผู้ใช้เป็นคะแนน (เต็ม 100) และแสดงผลการตัดคะแนน<br>
		1.3. โปรแกรมเครื่องคิดเลขสองจำนวน โดยรับค่าจากผู้ใช้ (บวก ลบ คูณ หาร ...)<br>
		1.4. โปรแกรมอื่นๆที่ใช้เทคนิคมากกว่า 1.1,1.2,1.3<br>
		<p>เมื่อเขียนและทดสอบเสร็จแล้วให้ทำการส่ง code ไฟล์ทั้งหมดมา</p>
	</div><br/>
<p align="center">สามารถส่งแบบฝึกหัดมาได้ที่ csag@kmi.tl</p>