<h1>ข้อปฏิบัติในการเข้าอบรม</h1>
<ol>
	<li>เตรียมบัตรนักศึกษา หรือบัตรที่หน่วยงานราชการออกให้ เพื่อใช้เป็นหลักฐานในการเข้าสอบ หากไม่มีหลักฐานดังกล่าว ให้ติดต่อกับทาง CSAG ล่วงหน้าอย่างน้อย 1 วัน</li>
    <li>เตรียมปากกา สมุด เพื่อใช้จดบันทึกระหว่างการอบรม</li>
    <li>แต่งกายสุภาพเรียบร้อย กางเกงขายาว รองเท้าหุ้มส้น</li>
    <li>มาให้ตรงเวลา เพื่อที่จะได้รับประโยชน์จากการอบรมอย่างเต็มที่</li>
</ol>
** หากติดแลป ก็ให้ไปเรียนแลปตามปกติ และติดตามทำแบบฝึกหัดและเอกสารประกอบการสอนเพื่อให้เกิดความเข้าใจ ได้ที่เว็บ http://csag.kmi.tl/regis นะครับ (ต้อง Login เข้าไปก่อน)
<p>&nbsp;</p>
<h1>ข้อปฏิบัติในการเข้าสอบ</h1>
<ol>
	<li>เตรียมบัตรนักศึกษา หรือบัตรที่หน่วยงานราชการออกให้ เพื่อใช้เป็นหลักฐานในการเข้าสอบ หากไม่มีหลักฐานดังกล่าว ให้ติดต่อกับทาง CSAG 	ล่วงหน้าอย่างน้อย 1 วัน</li>
    <li>แต่งกายสุภาพเรียบร้อย กางเกงขายาว รองเท้าหุ้มส้น</li>
    <li>อนุญาตให้ผู้เข้าสอบนำเอา ปากกา ดินสอ ยางลบ ไม้บรรทัด ปากกาลบคำผิด วงเวียน ครึ่งวงกลม เข้าห้องสอบได้</li>
    <li><strong>ไม่</strong>อนุญาตให้ผู้เข้าสอบนำเครื่องคำนวณ อุปกรณ์อิเล็คทรอนิกส์ เข้าห้องสอบ อาทิ เครื่องคิดเลข เครื่องคอมพิวเตอร์ เครื่องคอมพิวเตอร์ขนาดพกพา</li>
    <li><strong>ไม่</strong>อนุญาตให้ผู้เข้าสอบใช้เครื่องมือสื่อสารทุกชนิด หรือการติดต่อที่ผ่านทุกโพรโตคอลใดๆ/พอร์ตใดๆ</li>
    <li><strong>ไม่</strong>อนุญาตให้ผู้เข้าสอบนำข้อสอบ หรือกระดาษคำตอบ ไม่ว่าส่วนใดๆ ออกจากห้องสอบ</li>
    <li><strong>ไม่</strong>อนุญาตให้ผู้เข้าสอบเข้าห้องสอบหลังจากผ่านเวลาเริ่มกำหนดสอบไปแล้ว 1 ชั่วโมง</li>
    <li>ทางผู้จัดสอบข้อสงวนสิทธิ์ในการติดสิน ไม่ว่าในกรณีใดๆ โดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า</li>
</ol>